class CfgPatches {
	class IMP_Optic_1P21 {
		units[] = {"IMP_Optic_1P21_Base"};
		weapons[] = {};
		requiredVersion = 0.1;
		requiredAddons[]=
		{
			"DZ_Data",
			"DZ_Weapons_Optics",
			"DZ_Scripts"
		};
	};
};

class cfgVehicles {
	class Inventory_Base;
	class ItemOptics;
	
	class IMP_Optic_1P21_Base : ItemOptics {
		scope = 0;
		repairableWithKits[]={7};
		repairCosts[]={25};
		displayName = "$STR_IMP_1P21";
		descriptionShort = "$STR_IMP_16xzoom";
		model = "\IMPWMOD\Weapons\Optics\1P21\models\1P21.p3d";
		animClass = "Binoculars";
		rotationFlags = 4;
		reversed = 0;
		weight = 1300;
		itemSize[] = {3, 2};
		inventorySlot = "weaponOpticsAK";
		simulation = "itemoptics";
		dispersionModifier = -0.00025;//Параметр "dispersionModifier" определяет величину модификатора разброса при стрельбе. В данном случае, значение параметра равно -0.00025, что означает, что разброс при стрельбе будет уменьшаться на указанную величину
		dispersionCondition = "true";
		recoilModifier[]={0.95, 0.95, 1};
		swayModifier[]={0.95, 0.95, 1};//Параметр "recoilModifier" определяет величину модификатора отдачи при стрельбе в трех направлениях: по горизонтали, по вертикали и вдоль оси Z. В данном случае, значение параметра равно {1, 1, 1}, что означает, что модификатор отдачи не изменяется
		
		memoryPointCamera = "eyeScope";
		hiddenSelections[]=
		{
			"camoflage"
		};
		hiddenSelectionsTextures[]=
		{
			"IMPWMOD\Weapons\Optics\1P21\data\1P21_co.paa",
		};
		cameraDir = "cameraDir";
		
		class DamageSystem {
			class GlobalHealth {
				class Health {
					hitpoints = 100;
					healthLevels[] = {{1.01, {"IMPWMOD\Weapons\Optics\1P21\data\1P21.rvmat"}}, {0.7, {"IMPWMOD\Weapons\Optics\1P21\data\1P21.rvmat"}}, {0.5, {"IMPWMOD\Weapons\Optics\1P21\data\1P21_damage.rvmat"}}, {0.3, {"IMPWMOD\Weapons\Optics\1P21\data\1P21_damage.rvmat"}}, {0.01, {"IMPWMOD\Weapons\Optics\1P21\data\1P21_destruct.rvmat"}}};
				};
			};
		};
		
		class OpticsInfo {
			memoryPointCamera = "eyeScope";
			cameraDir = "cameraDir";
			useModelOptics = 1;
			modelOptics = "\IMPWMOD\Weapons\Optics\1P21\models\OpticView_1P21.p3d";
			preloadOpticType = "OpticView_1P21";
			opticsDisablePeripherialVision = 0.67;//Параметр "opticsDisablePeripherialVision" определяет величину отключения периферийного зрения при использовании прицела. В данном случае, значение параметра равно 0.67, что означает, что периферийное зрение будет отключено на 67% при использовании прицела
			opticsFlare = 1;//Параметр "opticsFlare" определяет наличие вспышки при использовании прицела. В данном случае, значение параметра равно 1, что означает, что вспышка при использовании прицела будет присутствовать
			opticsPPEffects[] = {"OpticsCHAbera3", "OpticsBlur1"};
			opticsZoomMin = 0.3926/4;//Параметр "opticsZoomMin" определяет минимальное значение увеличения прицела. В данном случае, значение параметра равно 0.3926/4, что означает, что минимальное увеличение прицела будет равно 0.09815
			opticsZoomMax = 0.3926/16;//Параметр "opticsZoomMax" определяет максимальное значение увеличения прицела. В данном случае, значение параметра равно 0.3926/16, что означает, что максимальное увеличение прицела будет равно 0.02454
			opticsZoomInit = 0.3926/4;//Параметр "opticsZoomInit" определяет начальное значение увеличения прицела. В данном случае, значение параметра равно 0.3926/4, что означает, что начальное увеличение прицела будет равно 0.09815
			discretefov[] = {0.3926/4, 0.3926/8, 0.3926/12, 0.3926/16};//Параметр "discretefov" определяет дискретные значения увеличения прицела. В данном случае, значение параметра равно {0.3926/4, 0.3926/8, 0.3926/12, 0.3926/16}, что означает, что дискретные значения увеличения прицела будут равны 0.09815, 0.04908, 0.03272 и 0.02454 соответственно
			discreteInitIndex = 0;//Параметр "discreteInitIndex" определяет начальный индекс дискретных значений увеличения прицела. В данном случае, значение параметра равно 0, что означает, что начальным увеличением прицела будет 0.09815
			distanceZoomMin = 100;//Параметр "distanceZoomMin" определяет минимальную дистанцию, на которой можно использовать увеличение прицела. В данном случае, значение параметра равно 100, что означает, что увеличение прицела можно использовать на дистанции от 100 метров и выше
			distanceZoomMax = 1300;//Параметр "distanceZoomMax" определяет максимальную дистанцию, на которой можно использовать увеличение прицела. В данном случае, значение параметра равно 1300, что означает, что увеличение прицела можно использовать на дистанции до 1300 метров
			discreteDistance[] = {100, 200, 300, 400, 500, 600, 700, 800, 900, 1000, 1100, 1200, 1300};//Параметр "discreteDistance" определяет дискретные значения дистанции для использования увеличения прицела. В данном случае, значение параметра равно {100, 200, 300, 400, 500, 600, 700, 800, 900, 1000, 1100, 1200, 1300}, что означает, что дискретные значения дистанции для использования увеличения прицела будут равны 100, 200, 300, 400, 500, 600, 700, 800, 900, 1000, 1100, 1200 и 1300 метров соответственно
			discreteDistanceInitIndex = 0;//Параметр "discreteDistanceInitIndex" определяет начальный индекс дискретных значений дистанции для использования увеличения прицела. В данном случае, значение параметра равно 0, что означает, что начальной дистанцией для использования увеличения прицела будет 100 метров
			PPMaskProperties[] = {0.5, 0.5, 0.43, 0.1};//Параметр "PPMaskProperties" определяет свойства маскировки при использовании прицела. В данном случае, значение параметра равно {0.5, 0.5, 0.43, 0.1}, что означает, что маскировка будет иметь следующие свойства: 0.5 - сила маскировки цвета красного; 0.5 - сила маскировки цвета зеленого; 0.43 - сила маскировки цвета синего; 0.1 - сила маскировки яркости.
			PPLensProperties[] = {0.3, 0.15, 0, 0};// Параметр "PPLensProperties" определяет свойства линзы при использовании прицела. В данном случае, значение параметра равно {0.3, 0.15, 0, 0}, что означает, что линза будет иметь следующие свойства: 0.3 - сила искажения цвета красного; 0.15 - сила  0 - сила искажения цвета синего; 0 - сила искажения яркости
			PPBlurProperties = 0.3;//Параметр "PPBlurProperties" определяет свойства размытия при использовании прицела. В данном случае, значение параметра равно 0.3, что означает, что размытие будет иметь силу 0.3
		};
		
		class AnimationSources {
			class hide {
				source = "user";
				animPeriod = 0.01;
				initPhase = 0;
			};
		};
	};
	class OpticView_1P21: Inventory_Base
	{
		scope = 0;
		model = "IMPWMOD\Weapons\Optics\1P21\models\OpticView_1P21.p3d";
	};
	class IMP_Optic_1P21: IMP_Optic_1P21_Base
	{
		scope = 2;
	};
};
